espressif/openocd-esp32/contrib/loaders/flash/esp32/stub_flasher.c
    esp_rom_spiflash_result_t rc = esp_rom_spiflash_erase_sector(flash_addr / STUB_FLASH_SECTOR_SIZE);
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to erase flash (%d)\n", rc);
        return ESP_STUB_ERR_FAIL;
    }

    rc = esp_rom_spiflash_write(flash_addr, (uint32_t *)buf, sizeof(buf));
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to write flash (%d)\n", rc);
        return ESP_STUB_ERR_FAIL;
    }

    rc = esp_rom_spiflash_read(flash_addr, (uint32_t *)buf, sizeof(buf));
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to read flash (%d)\n", rc);
        return ESP_STUB_ERR_FAIL;
    }

    STUB_LOGD("Data: ");
    for (int i = 0; i < 10; i++) {
        STUB_LOGD("%x ", buf[i]);
    }
    STUB_LOGD("\n");

    return ret;
}
#endif

static int stub_apptrace_init()
{
    STUB_LOGI("Init apptrace module\n");
    esp_err_t err = esp_apptrace_init();
    if (err != ESP_OK) {
        STUB_LOGE("Failed to init apptrace module (%d)!\n", err);
        return ESP_STUB_ERR_FAIL;
    }
    // imply that host is auto-connected
    uint32_t reg = eri_read(ESP_APPTRACE_TRAX_CTRL_REG);
    reg |= ESP_APPTRACE_TRAX_HOST_CONNECT;
    eri_write(ESP_APPTRACE_TRAX_CTRL_REG, reg);

    return ESP_STUB_ERR_OK;
}

static int stub_flash_read(uint32_t addr, uint32_t size)
{
    esp_rom_spiflash_result_t rc;
    uint32_t total_cnt = 0;

    int ret = stub_apptrace_init();
    if (ret != ESP_STUB_ERR_OK) {
        return ret;
    }

    STUB_LOGI("Start reading %d bytes @ 0x%x\n", size, addr);

    while (total_cnt < size) {
        uint32_t rd_sz = size - total_cnt > ESP_APPTRACE_USR_DATA_LEN_MAX ? ESP_APPTRACE_USR_DATA_LEN_MAX : size - total_cnt;
        if (rd_sz & 0x3UL) {
            rd_sz &= ~0x3UL;
        }
        if (rd_sz == 0) {
            break;
        }
        uint32_t start = xthal_get_ccount();
        uint8_t *buf = esp_apptrace_buffer_get(ESP_APPTRACE_DEST_TRAX, rd_sz, ESP_APPTRACE_TMO_INFINITE);
        if (!buf) {
            STUB_LOGE("Failed to get trace buf!\n");
            return ESP_STUB_ERR_FAIL;
        }
        uint32_t end = xthal_get_ccount();
        STUB_LOGD("Got trace buf %d bytes @ 0x%x in %d ms\n", rd_sz, buf, CPUTICKS2US(end - start) / 1000);

        start = xthal_get_ccount();
        rc = esp_rom_spiflash_read(addr + total_cnt, (uint32_t *)buf, rd_sz);
        end = xthal_get_ccount();
        STUB_LOGD("Read flash @ 0x%x sz %d in %d ms\n", addr + total_cnt, rd_sz, CPUTICKS2US(end - start) / 1000);
        if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
            STUB_LOGE("Failed to read flash (%d)!\n", rc);
            esp_apptrace_buffer_put(ESP_APPTRACE_DEST_TRAX, buf, ESP_APPTRACE_TMO_INFINITE);
            return ESP_STUB_ERR_FAIL;
        }
        total_cnt += rd_sz;

        esp_err_t err = esp_apptrace_buffer_put(ESP_APPTRACE_DEST_TRAX, buf, ESP_APPTRACE_TMO_INFINITE);
        if (err != ESP_OK) {
            STUB_LOGE("Failed to put trace buf!\n");
            return ESP_STUB_ERR_FAIL;
        }
        err = esp_apptrace_flush(ESP_APPTRACE_DEST_TRAX, ESP_APPTRACE_TMO_INFINITE);
        if (err != ESP_OK) {
            STUB_LOGE("Failed to flush trace buf!\n");
            return ESP_STUB_ERR_FAIL;
        }
        STUB_LOGE("Sent trace buf %d bytes @ 0x%x\n", rd_sz, buf);
    }

    if (total_cnt < size) {
        if ((size - total_cnt) >= 4) {
            STUB_LOGE("Exited loop when remaing data size is more the 4 bytes!\n");
            return ESP_STUB_ERR_FAIL; /*should never get here*/
        }
        // if we exited loop because remaing data size is less than 4 bytes
        uint8_t last_bytes[4];
        rc = esp_rom_spiflash_read(addr + total_cnt, (uint32_t *)last_bytes, 4);
        STUB_LOGD("Read padded word from flash @ 0x%x\n", addr + total_cnt);
        if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
            STUB_LOGE("Failed to read last word from flash (%d)!\n", rc);
            return ESP_STUB_ERR_FAIL;
        }
        uint8_t *buf = esp_apptrace_buffer_get(ESP_APPTRACE_DEST_TRAX, size - total_cnt, ESP_APPTRACE_TMO_INFINITE);
        if (!buf) {
            STUB_LOGE("Failed to get trace buf!\n");
            return ESP_STUB_ERR_FAIL;
        }
        memcpy(buf, last_bytes, size - total_cnt);
        esp_err_t err = esp_apptrace_buffer_put(ESP_APPTRACE_DEST_TRAX, buf, ESP_APPTRACE_TMO_INFINITE);
        if (err != ESP_OK) {
            STUB_LOGE("Failed to put trace buf!\n");
            return ESP_STUB_ERR_FAIL;
        }
        err = esp_apptrace_flush(ESP_APPTRACE_DEST_TRAX, ESP_APPTRACE_TMO_INFINITE);
        if (err != ESP_OK) {
            STUB_LOGE("Failed to flush trace buf!\n");
            return ESP_STUB_ERR_FAIL;
        }
        STUB_LOGE("Sent last trace buf %d bytes @ 0x%x\n", size - total_cnt, buf);
    }
    STUB_LOGD("Read %d bytes @ 0x%x\n", size, addr);

    return ESP_STUB_ERR_OK;
}

static int stub_flash_write(uint32_t addr, uint32_t size, uint8_t *down_buf, uint32_t down_size)
{
    esp_rom_spiflash_result_t rc;
    uint32_t total_cnt = 0;
    uint8_t cached_bytes_num = 0, cached_bytes[4];
    STUB_LOGD("Start writing %d bytes @ 0x%x\n", size, addr);

    int ret = stub_apptrace_init();
    if (ret != ESP_STUB_ERR_OK) {
        return ret;
    }
    STUB_LOGI("Init apptrace module down buffer %d bytes @ 0x%x\n", down_size, down_buf);
    esp_apptrace_down_buffer_config(down_buf, down_size);

    while (total_cnt < size) {
        uint32_t wr_sz = size - total_cnt - cached_bytes_num;
        STUB_LOGD("Req trace down buf %d bytes %d-%d-%d\n", wr_sz, size, total_cnt, cached_bytes_num);
        uint32_t start = xthal_get_ccount();
        uint8_t *wr_p, *buf = esp_apptrace_down_buffer_get(ESP_APPTRACE_DEST_TRAX, &wr_sz, ESP_APPTRACE_TMO_INFINITE);
        if (!buf) {
            STUB_LOGE("Failed to get trace down buf!\n");
            return ESP_STUB_ERR_FAIL;
        }
        uint32_t end = xthal_get_ccount();
        STUB_LOGD("Got trace down buf %d bytes @ 0x%x in %d ms\n", wr_sz, buf, CPUTICKS2US(end - start) / 1000);

        wr_p = buf;
        if (cached_bytes_num != 0) {
            // add cached bytes from the end of the prev buffer to the starting bytes of the current one
            memcpy(&cached_bytes[cached_bytes_num], buf, 4 - cached_bytes_num);
            rc = esp_rom_spiflash_write(addr + total_cnt, (uint32_t *)cached_bytes, 4);
            STUB_LOGD("Write padded word [%x %x %x %x] to flash @ 0x%x\n",
                    cached_bytes[0], cached_bytes[1], cached_bytes[2], cached_bytes[3], addr + total_cnt);
            if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
                STUB_LOGE("Failed to write flash (%d)\n", rc);
                esp_apptrace_down_buffer_put(ESP_APPTRACE_DEST_TRAX, buf, ESP_APPTRACE_TMO_INFINITE);
                return ESP_STUB_ERR_FAIL;
            }
            wr_p += 4 - cached_bytes_num;
            wr_sz -= 4 - cached_bytes_num;
            total_cnt += 4;
            cached_bytes_num = 0;
        }
        if (wr_sz & 0x3UL) {
            cached_bytes_num = wr_sz & 0x3UL;
            wr_sz &= ~0x3UL;
            memcpy(cached_bytes, wr_p + wr_sz, cached_bytes_num);
        }
        // write buffer with aligned size
        if (wr_sz) {
            start = xthal_get_ccount();
            rc = esp_rom_spiflash_write(addr + total_cnt, (uint32_t *)wr_p, wr_sz);
            end = xthal_get_ccount();
            STUB_LOGD("Write flash @ 0x%x sz %d in %d ms\n", addr + total_cnt, wr_sz, CPUTICKS2US(end - start) / 1000);
            if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
                STUB_LOGE("Failed to write flash (%d)\n", rc);
                esp_apptrace_down_buffer_put(ESP_APPTRACE_DEST_TRAX, buf, ESP_APPTRACE_TMO_INFINITE);
                return ESP_STUB_ERR_FAIL;
            }
            total_cnt += wr_sz;
        }
        // free buffer
        esp_err_t err = esp_apptrace_down_buffer_put(ESP_APPTRACE_DEST_TRAX, buf, ESP_APPTRACE_TMO_INFINITE);
        if (err != ESP_OK) {
            STUB_LOGE("Failed to put trace buf!\n");
            return ESP_STUB_ERR_FAIL;
        }
        STUB_LOGD("Recvd trace down buf %d bytes @ 0x%x\n", wr_sz, buf);
    }

