espressif/openocd-esp32/contrib/loaders/flash/esp32/stub_flasher.c
    if (cached_bytes_num != 0) {
        // add padding to cached bytes from the end of the last buffer
        while (cached_bytes_num & 0x3UL) {
            cached_bytes[cached_bytes_num++] = 0xFF;
        }
        rc = esp_rom_spiflash_write(addr + total_cnt, (uint32_t *)cached_bytes, 4);
        STUB_LOGD("Write last padded word to flash @ 0x%x\n", addr + total_cnt);
        if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
            STUB_LOGE("Failed to write flash (%d)\n", rc);
            return ESP_STUB_ERR_FAIL;
        }
    }

    STUB_LOGD("Wrote %d bytes @ 0x%x\n", size, addr);

    return ESP_STUB_ERR_OK;
}

static int stub_flash_erase(uint32_t flash_addr, uint32_t size)
{
    int ret = ESP_STUB_ERR_OK;

    if (flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) {
        flash_addr &= ~(STUB_FLASH_SECTOR_SIZE - 1);
    }

    if (size & (STUB_FLASH_SECTOR_SIZE - 1)) {
        size = (size + (STUB_FLASH_SECTOR_SIZE - 1)) & ~(STUB_FLASH_SECTOR_SIZE - 1);
    }

    STUB_LOGD("erase flash @ 0x%x, sz %d\n", flash_addr, size);
    esp_rom_spiflash_result_t rc = esp_rom_spiflash_erase_area(flash_addr, size);
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to erase flash (%d)\n", rc);
        return ESP_STUB_ERR_FAIL;
    }

    return ret;
}

static int stub_flash_erase_check(uint32_t start_sec, uint32_t sec_num, uint8_t *sec_erased)
{
    int ret = ESP_STUB_ERR_OK;
    uint8_t buf[STUB_FLASH_SECTOR_SIZE / 8]; // implying that sector size is multiple of sizeof(buf)

    STUB_LOGD("erase check start %d, sz %d\n", start_sec, sec_num);

    for (int i = start_sec; i < start_sec + sec_num; i++) {
        sec_erased[i] = 1;
        for (int k = 0; k < STUB_FLASH_SECTOR_SIZE / sizeof(buf); k++) {
            esp_rom_spiflash_result_t rc = esp_rom_spiflash_read(i * STUB_FLASH_SECTOR_SIZE + k * sizeof(buf), (uint32_t *)buf, sizeof(buf));
            if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
                STUB_LOGE("Failed to read flash (%d)!\n", rc);
                return ESP_STUB_ERR_FAIL;
            }
            for (int n = 0; n < sizeof(buf); n++) {
                if (buf[n] != 0xFF) {
                    sec_erased[i] = 0;
                    break;
                }
            }
            if (!sec_erased[i]) {
                break;
            }
        }
    }

    STUB_LOGD("erase checked\n");

    return ret;
}

#ifndef CONFIG_CHIP_IS_ESP32C
static uint32_t stub_flash_exec_usr_cmd(uint32_t cmd)
{
    uint32_t status_value = ESP_ROM_SPIFLASH_BUSY_FLAG;

    while (ESP_ROM_SPIFLASH_BUSY_FLAG == (status_value & ESP_ROM_SPIFLASH_BUSY_FLAG)) {
        WRITE_PERI_REG(PERIPHS_SPI_FLASH_STATUS, 0);       // clear register
        WRITE_PERI_REG(PERIPHS_SPI_FLASH_CMD, SPI_USR | cmd);
        while (READ_PERI_REG(PERIPHS_SPI_FLASH_CMD) != 0);

        status_value = READ_PERI_REG(PERIPHS_SPI_FLASH_STATUS) & g_rom_spiflash_chip.status_mask;
    }

    return status_value;
}

static void stub_flash_spi_wait_ready()
{
    uint32_t status_value = ESP_ROM_SPIFLASH_BUSY_FLAG;

    while (ESP_ROM_SPIFLASH_BUSY_FLAG == (status_value & ESP_ROM_SPIFLASH_BUSY_FLAG)) {
        WRITE_PERI_REG(PERIPHS_SPI_FLASH_STATUS, 0);       // clear register
        WRITE_PERI_REG(PERIPHS_SPI_FLASH_CMD, SPI_FLASH_RDSR);
        while (READ_PERI_REG(PERIPHS_SPI_FLASH_CMD) != 0);
        status_value = READ_PERI_REG(PERIPHS_SPI_FLASH_STATUS) & (g_rom_spiflash_chip.status_mask);
    }
}

static uint32_t stub_flash_spi_cmd_run(uint32_t cmd, uint8_t data_bits[], uint32_t data_bits_num, uint32_t read_bits_num)
{
    uint32_t old_spi_usr = READ_PERI_REG(PERIPHS_SPI_FLASH_USRREG);
    uint32_t old_spi_usr2 = READ_PERI_REG(PERIPHS_SPI_FLASH_USRREG2);
    uint32_t flags = SPI_USR_COMMAND;

    stub_flash_spi_wait_ready();

    if (read_bits_num > 0) {
        flags |= SPI_USR_MISO;
        WRITE_PERI_REG(PERIPHS_SPI_MISO_DLEN_REG, read_bits_num - 1);
    }
    if (data_bits_num > 0) {
        flags |= SPI_USR_MOSI;
        WRITE_PERI_REG(PERIPHS_SPI_MOSI_DLEN_REG, data_bits_num - 1);
    }

    WRITE_PERI_REG(PERIPHS_SPI_FLASH_USRREG, flags);
    WRITE_PERI_REG(PERIPHS_SPI_FLASH_USRREG2, (7 << SPI_USR2_DLEN_SHIFT) | cmd);
    if (data_bits_num == 0) {
        WRITE_PERI_REG(PERIPHS_SPI_FLASH_C0, 0);
    } else {
        for (uint32_t i = 0; i <= data_bits_num / 32; i += 32) {
            WRITE_PERI_REG(PERIPHS_SPI_FLASH_C0 + i / 8, *((uint32_t *)&data_bits[i / 8]));
        }
    }
    stub_flash_exec_usr_cmd(0);
    uint32_t status = READ_PERI_REG(PERIPHS_SPI_FLASH_C0);
    // restore some SPI controller registers
    WRITE_PERI_REG(PERIPHS_SPI_FLASH_USRREG, old_spi_usr);
    WRITE_PERI_REG(PERIPHS_SPI_FLASH_USRREG2, old_spi_usr2);

    return status;
}
#endif

inline static uint32_t stub_flash_get_id(void)
{
    uint32_t ret;

    STUB_LOGD("flash %x, cs %x, bs %x, ss %x, ps %x, sm %x\n", g_rom_spiflash_chip.device_id, g_rom_spiflash_chip.chip_size,
              g_rom_spiflash_chip.block_size, g_rom_spiflash_chip.sector_size, g_rom_spiflash_chip.page_size, g_rom_spiflash_chip.status_mask);
#if CONFIG_CHIP_IS_ESP32C
    WRITE_PERI_REG(PERIPHS_SPI_FLASH_C0, 0);    // clear regisrter
    WRITE_PERI_REG(PERIPHS_SPI_FLASH_CMD, SPI_MEM_FLASH_RDID);
    while(READ_PERI_REG(PERIPHS_SPI_FLASH_CMD) != 0);
    ret = READ_PERI_REG(PERIPHS_SPI_FLASH_C0) & 0xffffff;
#else
    ret = stub_flash_spi_cmd_run(STUB_SPI_FLASH_RDID, NULL, 0, 24);
#endif
    STUB_LOGD("Flash ID read %x\n", ret);
    return ret >> 16;
}

static uint32_t stub_flash_get_size(void)
{
    uint32_t size = 0;

    STUB_LOGD("%s: ENTER\n", __func__);

    uint32_t id = stub_flash_get_id();
    switch (id) {
    case 0x12: size = 256 * 1024; break;
    case 0x13: size = 512 * 1024; break;
    case 0x14: size = 1 * 1024 * 1024; break;
    case 0x15: size = 2 * 1024 * 1024; break;
    case 0x16: size = 4 * 1024 * 1024; break;
    case 0x17: size = 8 * 1024 * 1024; break;
    case 0x18: size = 16 * 1024 * 1024; break;
    default:
        size = 0;
    }
    STUB_LOGD("Flash ID %x, size %d KB\n", id, size / 1024);
    return size;
}

static inline bool stub_flash_should_map(uint32_t load_addr)
{
    return (load_addr >= SOC_IROM_LOW && load_addr < SOC_IROM_HIGH)
           || (load_addr >= SOC_DROM_LOW && load_addr < SOC_DROM_HIGH);
}

static int stub_flash_get_app_mappings(uint32_t off, struct esp_xtensa_flash_mapping *flash_map)
{
    esp_image_header_t img_hdr;
    uint16_t maps_num = 0;

    esp_rom_spiflash_result_t rc = esp_rom_spiflash_read(off, (uint32_t *)&img_hdr, sizeof(img_hdr));
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to read app image header (%d)!\n", rc);
        return ESP_STUB_ERR_FAIL;
    }
    if (img_hdr.magic != ESP_IMAGE_HEADER_MAGIC) {
        STUB_LOGE("Invalid magic number 0x%x in app image!\n", img_hdr.magic);
        return ESP_STUB_ERR_FAIL;
    }

