espressif/openocd-esp32/contrib/loaders/flash/esp32/stub_flasher.c
    STUB_LOGI("Found app image: magic 0x%x, %d segments, entry @ 0x%x\n", img_hdr.magic, img_hdr.segment_count, img_hdr.entry_addr);
    uint32_t flash_addr = off + sizeof(img_hdr);
    for (int k = 0; k < img_hdr.segment_count; k++) {
        esp_image_segment_header_t seg_hdr;
        rc = esp_rom_spiflash_read(flash_addr, (uint32_t *)&seg_hdr, sizeof(seg_hdr));
        if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
            STUB_LOGE("Failed to read app segment header (%d)!\n", rc);
            return ESP_STUB_ERR_FAIL;
        }
        STUB_LOGI("App segment %d: %d bytes @ 0x%x\n", k, seg_hdr.data_len, seg_hdr.load_addr);
        if (stub_flash_should_map(seg_hdr.load_addr)) {
            STUB_LOGI("Mapped segment %d: %d bytes @ 0x%x -> 0x%x\n", maps_num, seg_hdr.data_len, flash_addr + sizeof(seg_hdr), seg_hdr.load_addr);
            if (maps_num < ESP_STUB_FLASH_MAPPINGS_MAX_NUM) {
                flash_map->maps[maps_num].phy_addr = flash_addr + sizeof(seg_hdr);
                flash_map->maps[maps_num].load_addr = seg_hdr.load_addr;
                flash_map->maps[maps_num].size = seg_hdr.data_len;
                maps_num++;
            } else {
                break;
            }
        }
        flash_addr += sizeof(seg_hdr) + seg_hdr.data_len;
    }
    flash_map->maps_num = maps_num;
    return ESP_STUB_ERR_OK;
}

static int stub_flash_get_map(uint32_t app_off, uint32_t maps_addr)
{
    esp_rom_spiflash_result_t rc;
    esp_partition_info_t part;
    struct esp_xtensa_flash_mapping *flash_map = (struct esp_xtensa_flash_mapping *)maps_addr;
    uint32_t flash_size = stub_flash_get_size();

    STUB_LOGD("%s: 0x%x 0x%x\n", __func__, app_off, maps_addr);
    flash_map->maps_num = 0;
    if (app_off != (uint32_t)-1) {
        return stub_flash_get_app_mappings(app_off, flash_map);
    }

    for(uint32_t i = 0;; i++) {
        rc = esp_rom_spiflash_read(ESP_PARTITION_TABLE_OFFSET+i*sizeof(esp_partition_info_t), (uint32_t *)&part, sizeof(part));
        if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
            STUB_LOGE("Failed to read partitions table entrt (%d)!\n", rc);
            return ESP_STUB_ERR_FAIL;
        }
        if (part.magic != ESP_PARTITION_MAGIC) {
            STUB_LOGI("No app partition found 0x%x\n", part.magic);
            break;
        }
        if (part.pos.offset > flash_size || part.pos.offset + part.pos.size > flash_size) {
            STUB_LOGE("Partition %d invalid - offset 0x%x size 0x%x exceeds flash chip size 0x%x\n",
                      i, part.pos.offset, part.pos.size, flash_size);
            return ESP_STUB_ERR_FAIL;
        }
        STUB_LOGD("Found partition %d, m 0x%x, t 0x%x, st 0x%x, l '%s'\n", i, part.magic, part.type, part.subtype, part.label);
        if (part.type == PART_TYPE_APP) {
            STUB_LOGI("Found app partition: '%s' %d KB @ 0x%x\n", part.label, part.pos.size / 1024, part.pos.offset);
            return stub_flash_get_app_mappings(part.pos.offset, flash_map);
        }
    }
    return ESP_STUB_ERR_OK;
}

/**
* Possible BP layouts in flash:
* 1) addr is aligned to 4 bytes (in 1 sector)
* 2) addr is unaligned to 4 bytes, BP is not crossing sector's boundary (in 1 sector)
*   - not crossing 4 bytes alignment boundary
*   - crossing 4 bytes alignment boundary
* 3) addr is unaligned to 4 bytes, BP is crossing sector's boundary (in 2 sectors)
*/
static uint8_t stub_flash_set_bp(uint32_t bp_flash_addr, uint32_t insn_buf_addr, uint8_t *insn_sect)
{
    esp_rom_spiflash_result_t rc;

    STUB_LOGD("%s: 0x%x 0x%x\n", __func__, bp_flash_addr, insn_buf_addr);

    rc = esp_rom_spiflash_read(bp_flash_addr & ~(STUB_FLASH_SECTOR_SIZE - 1), (uint32_t *)insn_sect, ESP32_STUB_BP_INSN_SECT_BUF_SIZE);
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to read insn sector (%d)!\n", rc);
        return 0;
    }
    uint8_t insn_sz = xtensa_get_insn_size(&insn_sect[bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)]);
    memcpy((void *)insn_buf_addr, &insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1))], insn_sz);
    STUB_LOGI("Read insn [%02x %02x %02x] %d bytes @ 0x%x\n", insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 0], insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 1],
              insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 2], insn_sz, bp_flash_addr);

    // this will erase full sector or two
    if (stub_flash_erase(bp_flash_addr, insn_sz) != ESP_STUB_ERR_OK) {
        STUB_LOGE("Failed to erase insn sector!\n");
        return 0;
    }
    union {
        uint32_t d32;
        uint8_t d8[4];
    } break_insn;
    break_insn.d32 = insn_sz == 2 ? XT_INS_BREAKN : XT_INS_BREAK;
    insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 0] = break_insn.d8[0];
    insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 1] = break_insn.d8[1];
    if (insn_sz == 3) {
        insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 2] = break_insn.d8[2];
    }
    rc = esp_rom_spiflash_write(bp_flash_addr & ~(STUB_FLASH_SECTOR_SIZE - 1), (uint32_t *)insn_sect, ESP32_STUB_BP_INSN_SECT_BUF_SIZE);
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to write break insn (%d)!\n", rc);
        return 0;
    }
#if CONFIG_CHIP_IS_ESP32C
    // we do not know breakpoint program address here, so pass wrong addr to invalidate the whole ICache
    Cache_Invalidate_ICache_Items(0, 4*1024*1024);
#else
    Cache_Flush(0);
    Cache_Flush(1);
#endif
    return insn_sz;
}

static int stub_flash_clear_bp(uint32_t bp_flash_addr, uint32_t insn_buf_addr, uint8_t *insn_sect)
{
    esp_rom_spiflash_result_t rc;
    uint8_t *insn = (uint8_t *)insn_buf_addr;

    STUB_LOGD("%s: 0x%x 0x%x [%02x %02x %02x]\n", __func__, bp_flash_addr, insn_buf_addr, insn[0], insn[1], insn[2]);

    rc = esp_rom_spiflash_read(bp_flash_addr & ~(STUB_FLASH_SECTOR_SIZE - 1), (uint32_t *)insn_sect, ESP32_STUB_BP_INSN_SECT_BUF_SIZE);
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to read insn sector (%d)!\n", rc);
        return ESP_STUB_ERR_FAIL;
    }
    uint8_t insn_sz = xtensa_get_insn_size(insn);
    // this will erase full sector or two
    if (stub_flash_erase(bp_flash_addr, insn_sz) != ESP_STUB_ERR_OK) {
        STUB_LOGE("Failed to erase insn sector!\n");
        return ESP_STUB_ERR_FAIL;
    }
    insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 0] = insn[0];
    insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 1] = insn[1];
    if (insn_sz == 3) {
        insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 2] = insn[2];
    }
    rc = esp_rom_spiflash_write(bp_flash_addr & ~(STUB_FLASH_SECTOR_SIZE - 1), (uint32_t *)insn_sect, ESP32_STUB_BP_INSN_SECT_BUF_SIZE);
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to restore insn (%d)!\n", rc);
        return ESP_STUB_ERR_FAIL;
    }
#if CONFIG_CHIP_IS_ESP32C
    // we do not know breakpoint program address here, so pass wrong addr to invalidate the whole ICache
    Cache_Invalidate_ICache_Items(0, 4*1024*1024);
#else
    Cache_Flush(0);
    Cache_Flush(1);
#endif
#if STUB_LOG_LOCAL_LEVEL == STUB_LOG_VERBOSE
    uint8_t tmp[8];
    rc = esp_rom_spiflash_read(bp_flash_addr & ~0x3UL, (uint32_t *)tmp, sizeof(tmp));
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to read insn (%d)!\n", rc);
        return ESP_STUB_ERR_FAIL;
    }
    STUB_LOGD("%s: WROTE 0x%x 0x%x [%02x %02x %02x %02x %02x %02x %02x %02x]\n", __func__, bp_flash_addr, insn_buf_addr,
              tmp[0], tmp[1], tmp[2], tmp[3], tmp[4], tmp[5], tmp[6], tmp[7]);
#endif
    return ESP_STUB_ERR_OK;
}

#define STUB_FLASH_STATE_SPI_USER_REG_ID    0
#define STUB_FLASH_STATE_SPI_USER1_REG_ID   1
#define STUB_FLASH_STATE_SPI_USER2_REG_ID   2
#define STUB_FLASH_STATE_SPI_SLAVE_REG_ID   3
#define STUB_FLASH_STATE_REGS_NUM           4

#define STUB_FLASH_STATE_SPI_USER_REG_VAL    0x80000040
#define STUB_FLASH_STATE_SPI_USER1_REG_VAL   0x5c000007 //0x8c000007 ?
#define STUB_FLASH_STATE_SPI_USER2_REG_VAL   0x70000000
#define STUB_FLASH_STATE_SPI_SLAVE_REG_VAL   0x00000200 // 0x0 ??

