espressif/openocd-esp32/contrib/loaders/flash/esp32/stub_flasher.c
struct stub_flash_state {
    bool other_cache_enabled;
    uint32_t cache_flags[2];
    uint32_t spi_regs[STUB_FLASH_STATE_REGS_NUM];
};

static void stub_flash_state_prepare(struct stub_flash_state *state)
{
#ifdef CONFIG_CHIP_IS_ESP32C
    stub_spi_flash_disable_cache(state->cache_flags);
#else
    uint32_t core_id = stub_get_coreid();
    // TODO: generic support for multi-core (pass maximum number of cores as the first param)
    uint32_t other_core_id = core_id == 0 ? 1 : 0;

    state->other_cache_enabled = stub_spi_flash_cache_enabled(other_core_id);
    if (state->other_cache_enabled) {
        stub_spi_flash_disable_cache_for_cpu(other_core_id, &state->cache_flags[other_core_id]);
        STUB_LOGI("Cache disable CPU%d: 0x%x %d\n", other_core_id, state->cache_flags[other_core_id], stub_spi_flash_cache_enabled(other_core_id));
    }
    stub_spi_flash_disable_cache_for_cpu(core_id, &state->cache_flags[core_id]);
    STUB_LOGI("Cache disable CPU%d: 0x%x %d\n", core_id, state->cache_flags[core_id], stub_spi_flash_cache_enabled(core_id));

    state->spi_regs[STUB_FLASH_STATE_SPI_USER_REG_ID] = READ_PERI_REG(SPI_USER_REG(1));
    state->spi_regs[STUB_FLASH_STATE_SPI_USER1_REG_ID] = READ_PERI_REG(SPI_USER1_REG(1));
    state->spi_regs[STUB_FLASH_STATE_SPI_USER2_REG_ID] = READ_PERI_REG(SPI_USER2_REG(1));
    state->spi_regs[STUB_FLASH_STATE_SPI_SLAVE_REG_ID] = READ_PERI_REG(SPI_SLAVE_REG(1));
    WRITE_PERI_REG(SPI_USER_REG(1), STUB_FLASH_STATE_SPI_USER_REG_VAL);
    WRITE_PERI_REG(SPI_USER1_REG(1), STUB_FLASH_STATE_SPI_USER1_REG_VAL);
    WRITE_PERI_REG(SPI_USER2_REG(1), STUB_FLASH_STATE_SPI_USER2_REG_VAL);
    WRITE_PERI_REG(SPI_SLAVE_REG(1), STUB_FLASH_STATE_SPI_SLAVE_REG_VAL);
#endif
}

static void stub_flash_state_restore(struct stub_flash_state *state)
{
#ifdef CONFIG_CHIP_IS_ESP32C
    stub_spi_flash_restore_cache(state->cache_flags);
#else
    uint32_t core_id = stub_get_coreid();
    // TODO: generic support for multi-core (pass maximum number of cores as the first param)
    uint32_t other_core_id = core_id == 0 ? 1 : 0;

    WRITE_PERI_REG(SPI_USER_REG(1), state->spi_regs[STUB_FLASH_STATE_SPI_USER_REG_ID]);
    WRITE_PERI_REG(SPI_USER1_REG(1), state->spi_regs[STUB_FLASH_STATE_SPI_USER1_REG_ID]);
    WRITE_PERI_REG(SPI_USER2_REG(1), state->spi_regs[STUB_FLASH_STATE_SPI_USER2_REG_ID]);
    WRITE_PERI_REG(SPI_SLAVE_REG(1), state->spi_regs[STUB_FLASH_STATE_SPI_SLAVE_REG_ID]);
    if (state->other_cache_enabled) {
        stub_spi_flash_restore_cache_for_cpu(other_core_id, state->cache_flags[other_core_id]);
        STUB_LOGI("Cache restored CPU%d: 0x%x %d\n", other_core_id, state->cache_flags[other_core_id], stub_spi_flash_cache_enabled(other_core_id));
    }
    stub_spi_flash_restore_cache_for_cpu(core_id, state->cache_flags[core_id]);
    STUB_LOGI("Cache restored CPU%d: 0x%x %d\n", core_id, state->cache_flags[core_id], stub_spi_flash_cache_enabled(core_id));
#endif
}

static int stub_flash_handler(int cmd, va_list ap)
{
    int ret = ESP_STUB_ERR_OK;
    struct stub_flash_state flash_state;
    uint32_t arg1 = va_arg(ap, uint32_t);   // flash_addr, start_sect
    uint32_t arg2 = va_arg(ap, uint32_t);   // size, number of sectors
    uint8_t *arg3 = va_arg(ap, uint8_t *);  // down_buf_addr, sectorts' state buf address
    uint32_t arg4 = va_arg(ap, uint32_t);   // down buf size

    STUB_LOGD("%s a %x, s %d\n", __func__, arg1, arg2);

#ifndef CONFIG_CHIP_IS_ESP32C
    ets_efuse_read_op();
#endif

    uint32_t spiconfig = ets_efuse_get_spiconfig();
    uint32_t strapping = REG_READ(GPIO_STRAP_REG);
    //  If GPIO1 (U0TXD) is pulled low and no other boot mode is
    //    set in efuse, assume HSPI flash mode (same as normal boot)
    if (spiconfig == 0 && (strapping & 0x1c) == 0x08) {
        spiconfig = 1; /* HSPI flash mode */
    }

    stub_flash_state_prepare(&flash_state);

#if CONFIG_CHIP_IS_ESP32C
    spi_flash_attach(spiconfig, 0);
#else
    esp_rom_spiflash_attach(spiconfig, 0);
#endif
    uint32_t flash_size = stub_flash_get_size();
    if (flash_size == 0) {
        STUB_LOGE("Failed to get flash size!\n");
        ret = cmd == ESP_STUB_CMD_FLASH_SIZE ? 0 : ESP_STUB_ERR_FAIL;
        goto _flash_end;
    }
    if (cmd == ESP_STUB_CMD_FLASH_SIZE) {
        ret = flash_size;
        goto _flash_end;
    }
    esp_rom_spiflash_config_param(g_rom_flashchip.device_id, flash_size,
                                  ESP32_FLASH_BLOCK_SIZE, STUB_FLASH_SECTOR_SIZE, ESP32_FLASH_PAGE_SIZE, ESP32_FLASH_STATUS_MASK);

    esp_rom_spiflash_result_t rc = esp_rom_spiflash_unlock();
    if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
        STUB_LOGE("Failed to unlock flash (%d)\n", rc);
        ret = ESP_STUB_ERR_FAIL;
        goto _flash_end;
    }

    switch (cmd) {
    case ESP_STUB_CMD_FLASH_READ:
        ret = stub_flash_read(arg1, arg2);
        break;
    case ESP_STUB_CMD_FLASH_ERASE:
        ret = stub_flash_erase(arg1, arg2);
        break;
    case ESP_STUB_CMD_FLASH_ERASE_CHECK:
        ret = stub_flash_erase_check(arg1, arg2, arg3);
        break;
    case ESP_STUB_CMD_FLASH_WRITE:
        ret = stub_flash_write(arg1, arg2, arg3, arg4);
        break;
    case ESP_STUB_CMD_FLASH_MAP_GET:
        ret = stub_flash_get_map(arg1, arg2);
        break;
    case ESP_STUB_CMD_FLASH_BP_SET:
        ret = stub_flash_set_bp(arg1, arg2, arg3);
        break;
    case ESP_STUB_CMD_FLASH_BP_CLEAR:
        ret = stub_flash_clear_bp(arg1, arg2, arg3);
        break;
#if STUB_DEBUG
    case ESP_STUB_CMD_FLASH_TEST:
        ret = stub_flash_test();
        break;
#endif
    default:
        ret = ESP_STUB_ERR_NOT_SUPPORTED;
    }

_flash_end:
    stub_flash_state_restore(&flash_state);
    return ret;
}

void ets_update_cpu_frequency(uint32_t ticks_per_us)
{
    /* do nothing for stub */
}

#if STUB_LOG_LOCAL_LEVEL > STUB_LOG_NONE
static void clock_configure(void)
{
    /* Set CPU to 80MHz. Keep other clocks unmodified. */
    rtc_cpu_freq_t cpu_freq = RTC_CPU_FREQ_80M;

    /* On ESP32 rev 0, switching to 80MHz if clock was previously set to
     * 240 MHz may cause the chip to lock up (see section 3.5 of the errata
     * document). For rev. 0, switch to 240 instead if it was chosen in
     * menuconfig.
     */
#ifndef CONFIG_CHIP_IS_ESP32C
    uint32_t chip_ver_reg = REG_READ(EFUSE_BLK0_RDATA3_REG);
    if ((chip_ver_reg & EFUSE_RD_CHIP_VER_REV1_M) == 0 &&
            CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ == 240) {
        cpu_freq = RTC_CPU_FREQ_240M;
    }
#else
    if (CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ == 240) {
        cpu_freq = RTC_CPU_FREQ_240M;
    }
#endif

    // uart_tx_wait_idle(CONFIG_CONSOLE_UART_NUM);
    rtc_clk_config_t clk_cfg = RTC_CLK_CONFIG_DEFAULT();
    clk_cfg.xtal_freq = CONFIG_ESP32_XTAL_FREQ;
    clk_cfg.cpu_freq = cpu_freq;
    clk_cfg.slow_freq = rtc_clk_slow_freq_get();
    clk_cfg.fast_freq = rtc_clk_fast_freq_get();
    rtc_clk_init(clk_cfg);
}
static void uart_console_configure(void)
{
    uartAttach();
    ets_install_uart_printf();
    // Set configured UART console baud rate
    uart_div_modify(CONFIG_CONSOLE_UART_NUM, (rtc_clk_apb_freq_get() << 4) / CONFIG_CONSOLE_UART_BAUDRATE);
}
#endif

int stub_main(int cmd, ...)
{
    va_list ap;
    int ret = 0;

    /* zero bss */
    for (uint32_t *p = &_bss_start; p < &_bss_end; p++) {
        *p = 0;
    }

    // we get here just after OpenOCD's stub trampoline
    // up to 5 parameters are passed via registers by that jumping code
    // interrupts level in PS is set to 5 to allow high prio IRQs only (including Debug Interrupt)
    // We need Debug Interrupt Level to allow breakpoints handling by OpenOCD
#if STUB_LOG_LOCAL_LEVEL > STUB_LOG_NONE
    clock_configure();
    uart_console_configure();
#endif
    STUB_LOGD("BSS 0x%x..0x%x\n", &_bss_start, &_bss_end);
    STUB_LOGD("cmd %d\n", cmd);

    va_start(ap, cmd);
    if (cmd <= ESP_STUB_CMD_FLASH_MAX_ID) {
        ret = stub_flash_handler(cmd, ap);
    } else  switch (cmd) {
#if STUB_DEBUG
        case ESP_STUB_CMD_TEST:
            STUB_LOGD("TEST %d\n", cmd);
            break;
#endif
        default:
            ret = ESP_STUB_ERR_NOT_SUPPORTED;
        }
    va_end(ap);

    STUB_LOGD("exit %d\n", ret);
    return ret;
}
